app/views/projects/_tag_fields.html.erb

SELECT "tags".* FROM "tags"
---
<h3>Add Tags<h3>
<%= f.collection_select :tag_id, Tag.all, :id, :title, {:multiple => true}%>