app/views/projects/index.html.erb

SELECT "advisors".* FROM "advisors" WHERE "advisors"."project_id" = $1  [["project_id", 2]]
---
        <td>
        <%project.advisors.each do |advisor|%>

SELECT "collaborations".* FROM "collaborations" WHERE "collaborations"."project_id" = $1  [["project_id", 2]]
---
        <td>
        <%project.collaborations.each do |collaborator|%>

SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."project_id" = $1  [["project_id", 2]]
---
        <td>
        <%project.tags.each do |tag|%>