app/views/projects/show.html.erb

SELECT "donations".* FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 55]]
---
	<div class="stats"`
		<h4>Number of Donors: <%= @project.donations.length%></h4>

SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."project_id" = $1  [["project_id", 2]]
---
		Tags: <br/>
		<%@project.tags.each do |tag|%>

SELECT "advisors".* FROM "advisors" WHERE "advisors"."project_id" = $1  [["project_id", 2]]
---
		<div class="title inlineb"><b>Advisors:</b></div>
		<%@project.advisors.each do |advisor|%>

SELECT "collaborations".* FROM "collaborations" WHERE "collaborations"."project_id" = $1  [["project_id", 2]]
---
		<div class="title inlineb"><b>Collaborators:</b></div>
		<%@project.collaborations.each do |collaborator|%>