app/views/updates/_form.html.erb

    <% if params[:project_id] %>
      <% project = Project.find(params[:project_id]) %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "2"]]