app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    redirect_to root_path
    @projects = Project.all

INSERT INTO "projects" ("created_at", "description", "goal", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "owner_id", "title", "updated_at", "video") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    @project.owner_id = @current_user.id
    @project.addCollab
    @project.highlighted = false

    token = params[:stripeToken]

    recipient = Stripe::Recipient.create(
      :name => @current_user.name,
      :type => "individual",
      :email => @current_user.email,
      :bank_account => token
    )

UPDATE "projects" SET "image_updated_at" = $1, "image_file_name" = $2, "video" = $3, "updated_at" = $4 WHERE "projects"."id" = 2  [["image_updated_at", Wed, 13 Nov 2013 05:28:42 UTC +00:00], ["image_file_name", "calicon.png"], ["video", "http://youtu.be/x0IqNxQUGL8"], ["updated_at", Wed, 13 Nov 2013 05:28:43 UTC +00:00]]
---
  def update
    @project.taggables.destroy_all
    respond_to do |format|
      if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 3]]
---
  def destroy #BigCal
    @project.destroy