app/controllers/registrations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "last_name" = $1, "major" = $2, "grad_year" = $3, "updated_at" = $4 WHERE "users"."type" IN ('Student') AND "users"."id" = 1  [["last_name", "Sefah"], ["major", 6], ["grad_year", 2015], ["updated_at", Sun, 17 Nov 2013 21:25:31 EST -05:00]]
---
  def update
    # required for settings form to submit when password is left blank
    if account_update_params[:password].blank?
      account_update_params.delete("password")
      account_update_params.delete("password_confirmation")
    end

    @user = User.find(current_user.id)
    if @user.update_attributes(account_update_params)