app/controllers/updates_controller.rb

SELECT "updates".* FROM "updates"
---
  def index
    @updates = Update.all

INSERT INTO "updates" ("content", "created_at", "project_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "rrrrr"], ["created_at", Sun, 17 Nov 2013 19:55:29 UTC +00:00], ["project_id", 55], ["title", "rrr"], ["updated_at", Sun, 17 Nov 2013 19:55:29 UTC +00:00]]
---
  def create
    @update = Update.new(update_params)
    @update.creator_id = current_user.id
    @update.project_id = params[:project_id]
    respond_to do |format|
      if @update.save

SELECT "updates".* FROM "updates" WHERE "updates"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_update
      @update = Update.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 ORDER BY "projects"."id" ASC LIMIT 1  [["id", 50]]
---
    def set_project
  	  if params[:project_id]
          @project = Project.find(params[:project_id])